MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2331/mcu.h
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x7C51);	// @ (0xF8A * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x7C52);	// @ (0xF8A * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x7C53);	// @ (0xF8A * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x7C54);	// @ (0xF8A * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x7C55);	// @ (0xF8A * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0x7C56);	// @ (0xF8A * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0x7C57);	// @ (0xF8A * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x7C58);	// @ (0xF8B * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x7C59);	// @ (0xF8B * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x7C5A);	// @ (0xF8B * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x7C5B);	// @ (0xF8B * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x7C5C);	// @ (0xF8B * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x7C5D);	// @ (0xF8B * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x7C5E);	// @ (0xF8B * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x7C5F);	// @ (0xF8B * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATB<LB0>
extern volatile __bit                   LB0                 __at(0x7C50);	// @ (0xF8A * 8 + 0)
#define                                 LB0_bit             _BIT_ACCESS(LATB,0)
// LATB<LB1>
extern volatile __bit                   LB1                 __at(0x7C51);	// @ (0xF8A * 8 + 1)
#define                                 LB1_bit             _BIT_ACCESS(LATB,1)
// LATB<LB2>
extern volatile __bit                   LB2                 __at(0x7C52);	// @ (0xF8A * 8 + 2)
#define                                 LB2_bit             _BIT_ACCESS(LATB,2)
// LATB<LB3>
extern volatile __bit                   LB3                 __at(0x7C53);	// @ (0xF8A * 8 + 3)
#define                                 LB3_bit             _BIT_ACCESS(LATB,3)
// LATB<LB4>
extern volatile __bit                   LB4                 __at(0x7C54);	// @ (0xF8A * 8 + 4)
#define                                 LB4_bit             _BIT_ACCESS(LATB,4)
// LATB<LB5>
extern volatile __bit                   LB5                 __at(0x7C55);	// @ (0xF8A * 8 + 5)
#define                                 LB5_bit             _BIT_ACCESS(LATB,5)
// LATB<LB6>
extern volatile __bit                   LB6                 __at(0x7C56);	// @ (0xF8A * 8 + 6)
#define                                 LB6_bit             _BIT_ACCESS(LATB,6)
// LATB<LB7>
extern volatile __bit                   LB7                 __at(0x7C57);	// @ (0xF8A * 8 + 7)
#define                                 LB7_bit             _BIT_ACCESS(LATB,7)
// LATC<LC0>
extern volatile __bit                   LC0                 __at(0x7C58);	// @ (0xF8B * 8 + 0)
#define                                 LC0_bit             _BIT_ACCESS(LATC,0)
// LATC<LC1>
extern volatile __bit                   LC1                 __at(0x7C59);	// @ (0xF8B * 8 + 1)
#define                                 LC1_bit             _BIT_ACCESS(LATC,1)
// LATC<LC2>
extern volatile __bit                   LC2                 __at(0x7C5A);	// @ (0xF8B * 8 + 2)
#define                                 LC2_bit             _BIT_ACCESS(LATC,2)
// LATC<LC3>
extern volatile __bit                   LC3                 __at(0x7C5B);	// @ (0xF8B * 8 + 3)
#define                                 LC3_bit             _BIT_ACCESS(LATC,3)
// LATC<LC4>
extern volatile __bit                   LC4                 __at(0x7C5C);	// @ (0xF8B * 8 + 4)
#define                                 LC4_bit             _BIT_ACCESS(LATC,4)
// LATC<LC5>
extern volatile __bit                   LC5                 __at(0x7C5D);	// @ (0xF8B * 8 + 5)
#define                                 LC5_bit             _BIT_ACCESS(LATC,5)
// LATC<LC6>
extern volatile __bit                   LC6                 __at(0x7C5E);	// @ (0xF8B * 8 + 6)
#define                                 LC6_bit             _BIT_ACCESS(LATC,6)
// LATC<LC7>
extern volatile __bit                   LC7                 __at(0x7C5F);	// @ (0xF8B * 8 + 7)
#define                                 LC7_bit             _BIT_ACCESS(LATC,7)
// LVDCON<LVDEN>
extern volatile __bit                   LVDEN               __at(0x7E94);	// @ (0xFD2 * 8 + 4)
#define                                 LVDEN_bit           _BIT_ACCESS(LVDCON,4)
// PIE2<LVDIE>
extern volatile __bit                   LVDIE               __at(0x7D02);	// @ (0xFA0 * 8 + 2)
#define                                 LVDIE_bit           _BIT_ACCESS(PIE2,2)
// PIR2<LVDIF>
extern volatile __bit                   LVDIF               __at(0x7D0A);	// @ (0xFA1 * 8 + 2)
#define                                 LVDIF_bit           _BIT_ACCESS(PIR2,2)
// IPR2<LVDIP>
extern volatile __bit                   LVDIP               __at(0x7D12);	// @ (0xFA2 * 8 + 2)
#define                                 LVDIP_bit           _BIT_ACCESS(IPR2,2)
// LVDCON<LVDL0>
extern volatile __bit                   LVDL0               __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 LVDL0_bit           _BIT_ACCESS(LVDCON,0)
// LVDCON<LVDL1>
extern volatile __bit                   LVDL1               __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 LVDL1_bit           _BIT_ACCESS(LVDCON,1)
// LVDCON<LVDL2>
extern volatile __bit                   LVDL2               __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 LVDL2_bit           _BIT_ACCESS(LVDCON,2)
// LVDCON<LVDL3>
extern volatile __bit                   LVDL3               __at(0x7E93);	// @ (0xFD2 * 8 + 3)
#define                                 LVDL3_bit           _BIT_ACCESS(LVDCON,3)
// PORTE<MCLR>
extern volatile __bit                   MCLR                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 MCLR_bit            _BIT_ACCESS(PORTE,3)
// STATUS<NEGATIVE>
extern volatile __bit                   NEGATIVE            __at(0x7EC4);	// @ (0xFD8 * 8 + 4)
#define                                 NEGATIVE_bit        _BIT_ACCESS(STATUS,4)
// SSPSTAT<NOT_A>
extern volatile __bit                   NOT_A               __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_A_bit           _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<NOT_ADDRESS>
extern volatile __bit                   NOT_ADDRESS         __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_ADDRESS_bit     _BIT_ACCESS(SSPSTAT,5)
// RCON<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(RCON,0)
// ADCON0<NOT_DONE>
extern volatile __bit                   NOT_DONE            __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 NOT_DONE_bit        _BIT_ACCESS(ADCON0,1)
// QEICON<NOT_DOWN>
extern volatile __bit                   NOT_DOWN            __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 NOT_DOWN_bit        _BIT_ACCESS(QEICON,5)
// PORTC<NOT_FLTA>
extern volatile __bit                   NOT_FLTA            __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 NOT_FLTA_bit        _BIT_ACCESS(PORTC,1)
// PORTC<NOT_FLTB>
extern volatile __bit                   NOT_FLTB            __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 NOT_FLTB_bit        _BIT_ACCESS(PORTC,2)
// RCON<NOT_IPEN>
extern volatile __bit                   NOT_IPEN            __at(0x7E87);	// @ (0xFD0 * 8 + 7)
#define                                 NOT_IPEN_bit        _BIT_ACCESS(RCON,7)
// PORTE<NOT_MCLR>
extern volatile __bit                   NOT_MCLR            __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 NOT_MCLR_bit        _BIT_ACCESS(PORTE,3)
// RCON<NOT_PD>
extern volatile __bit                   NOT_PD              __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 NOT_PD_bit          _BIT_ACCESS(RCON,2)
// RCON<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(RCON,1)
// INTCON2<NOT_RBPU>
extern volatile __bit                   NOT_RBPU            __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 NOT_RBPU_bit        _BIT_ACCESS(INTCON2,7)
// T5CON<NOT_RESEN>
extern volatile __bit                   NOT_RESEN           __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 NOT_RESEN_bit       _BIT_ACCESS(T5CON,6)
// RCON<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 NOT_RI_bit          _BIT_ACCESS(RCON,4)
// PORTC<NOT_SS>
extern volatile __bit                   NOT_SS              __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 NOT_SS_bit          _BIT_ACCESS(PORTC,6)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x7DBA);	// @ (0xFB7 * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// RCON<NOT_TO>
extern volatile __bit                   NOT_TO              __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 NOT_TO_bit          _BIT_ACCESS(RCON,3)
// QEICON<NOT_VELM>
extern volatile __bit                   NOT_VELM            __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 NOT_VELM_bit        _BIT_ACCESS(QEICON,7)
// SSPSTAT<NOT_W>
extern volatile __bit                   NOT_W               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_W_bit           _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(SSPSTAT,2)
// RCSTA<OERR>
extern volatile __bit                   OERR                __at(0x7D59);	// @ (0xFAB * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RCSTA,1)
// PORTA<OSC1>
extern volatile __bit                   OSC1                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 OSC1_bit            _BIT_ACCESS(PORTA,7)
// PORTA<OSC2>
extern volatile __bit                   OSC2                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 OSC2_bit            _BIT_ACCESS(PORTA,6)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x7D07);	// @ (0xFA0 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x7D0F);	// @ (0xFA1 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// IPR2<OSFIP>
extern volatile __bit                   OSFIP               __at(0x7D17);	// @ (0xFA2 * 8 + 7)
#define                                 OSFIP_bit           _BIT_ACCESS(IPR2,7)
// OSCCON<OSTS>
extern volatile __bit                   OSTS                __at(0x7E9B);	// @ (0xFD3 * 8 + 3)
#define                                 OSTS_bit            _BIT_ACCESS(OSCCON,3)
// PWMCON1<OSYNC>
extern volatile __bit                   OSYNC               __at(0x7B70);	// @ (0xF6E * 8 + 0)
#define                                 OSYNC_bit           _BIT_ACCESS(PWMCON1,0)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// PORTC<PA1>
extern volatile __bit                   _PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)  // Note: Changed by MikroE
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   _PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)  // Note: Changed by MikroE
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PC3E>
extern volatile __bit                   PC3E                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 PC3E_bit            _BIT_ACCESS(PORTE,3)
// RCON<PD>
extern volatile __bit                   PD                  __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 PD_bit              _BIT_ACCESS(RCON,2)
// QEICON<PDEC0>
extern volatile __bit                   PDEC0               __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 PDEC0_bit           _BIT_ACCESS(QEICON,0)
// QEICON<PDEC1>
extern volatile __bit                   PDEC1               __at(0x7DB1);	// @ (0xFB6 * 8 + 1)
#define                                 PDEC1_bit           _BIT_ACCESS(QEICON,1)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// PWMCON0<PMOD0>
extern volatile __bit                   PMOD0               __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 PMOD0_bit           _BIT_ACCESS(PWMCON0,0)
// PWMCON0<PMOD1>
extern volatile __bit                   PMOD1               __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 PMOD1_bit           _BIT_ACCESS(PWMCON0,1)
// PWMCON0<PMOD2>
extern volatile __bit                   PMOD2               __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 PMOD2_bit           _BIT_ACCESS(PWMCON0,2)
// PWMCON0<PMOD3>
extern volatile __bit                   PMOD3               __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 PMOD3_bit           _BIT_ACCESS(PWMCON0,3)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// OVDCONS<POUT0>
extern volatile __bit                   POUT0               __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 POUT0_bit           _BIT_ACCESS(OVDCONS,0)
// OVDCONS<POUT1>
extern volatile __bit                   POUT1               __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 POUT1_bit           _BIT_ACCESS(OVDCONS,1)
// OVDCONS<POUT2>
extern volatile __bit                   POUT2               __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 POUT2_bit           _BIT_ACCESS(OVDCONS,2)
// OVDCONS<POUT3>
extern volatile __bit                   POUT3               __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 POUT3_bit           _BIT_ACCESS(OVDCONS,3)
// OVDCONS<POUT4>
extern volatile __bit                   POUT4               __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 POUT4_bit           _BIT_ACCESS(OVDCONS,4)
// OVDCONS<POUT5>
extern volatile __bit                   POUT5               __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 POUT5_bit           _BIT_ACCESS(OVDCONS,5)
// OVDCONS<POUT6>
extern volatile __bit                   POUT6               __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 POUT6_bit           _BIT_ACCESS(OVDCONS,6)
// OVDCONS<POUT7>
extern volatile __bit                   POUT7               __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 POUT7_bit           _BIT_ACCESS(OVDCONS,7)
// OVDCOND<POVD0>
extern volatile __bit                   POVD0               __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 POVD0_bit           _BIT_ACCESS(OVDCOND,0)
// OVDCOND<POVD1>
extern volatile __bit                   POVD1               __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 POVD1_bit           _BIT_ACCESS(OVDCOND,1)
// OVDCOND<POVD2>
extern volatile __bit                   POVD2               __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 POVD2_bit           _BIT_ACCESS(OVDCOND,2)
// OVDCOND<POVD3>
extern volatile __bit                   POVD3               __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 POVD3_bit           _BIT_ACCESS(OVDCOND,3)
// OVDCOND<POVD4>
extern volatile __bit                   POVD4               __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 POVD4_bit           _BIT_ACCESS(OVDCOND,4)
// OVDCOND<POVD5>
extern volatile __bit                   POVD5               __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 POVD5_bit           _BIT_ACCESS(OVDCOND,5)
// OVDCOND<POVD6>
extern volatile __bit                   POVD6               __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 POVD6_bit           _BIT_ACCESS(OVDCOND,6)
// OVDCOND<POVD7>
extern volatile __bit                   POVD7               __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 POVD7_bit           _BIT_ACCESS(OVDCOND,7)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PTCON0<PTCKPS0>
extern volatile __bit                   PTCKPS0             __at(0x7BFA);	// @ (0xF7F * 8 + 2)
#define                                 PTCKPS0_bit         _BIT_ACCESS(PTCON0,2)
// PTCON0<PTCKPS1>
extern volatile __bit                   PTCKPS1             __at(0x7BFB);	// @ (0xF7F * 8 + 3)
#define                                 PTCKPS1_bit         _BIT_ACCESS(PTCON0,3)
// PTCON1<PTDIR>
extern volatile __bit                   PTDIR               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 PTDIR_bit           _BIT_ACCESS(PTCON1,6)
// PTCON1<PTEN>
extern volatile __bit                   PTEN                __at(0x7BF7);	// @ (0xF7E * 8 + 7)
#define                                 PTEN_bit            _BIT_ACCESS(PTCON1,7)
// PIE3<PTIE>
extern volatile __bit                   PTIE                __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 PTIE_bit            _BIT_ACCESS(PIE3,4)
// PIR3<PTIF>
extern volatile __bit                   PTIF                __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 PTIF_bit            _BIT_ACCESS(PIR3,4)
// IPR3<PTIP>
extern volatile __bit                   PTIP                __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 PTIP_bit            _BIT_ACCESS(IPR3,4)
// PTCON0<PTMOD0>
extern volatile __bit                   PTMOD0              __at(0x7BF8);	// @ (0xF7F * 8 + 0)
#define                                 PTMOD0_bit          _BIT_ACCESS(PTCON0,0)
// PTCON0<PTMOD1>
extern volatile __bit                   PTMOD1              __at(0x7BF9);	// @ (0xF7F * 8 + 1)
#define                                 PTMOD1_bit          _BIT_ACCESS(PTCON0,1)
// PTCON0<PTOPS0>
extern volatile __bit                   PTOPS0              __at(0x7BFC);	// @ (0xF7F * 8 + 4)
#define                                 PTOPS0_bit          _BIT_ACCESS(PTCON0,4)
// PTCON0<PTOPS1>
extern volatile __bit                   PTOPS1              __at(0x7BFD);	// @ (0xF7F * 8 + 5)
#define                                 PTOPS1_bit          _BIT_ACCESS(PTCON0,5)
// PTCON0<PTOPS2>
extern volatile __bit                   PTOPS2              __at(0x7BFE);	// @ (0xF7F * 8 + 6)
#define                                 PTOPS2_bit          _BIT_ACCESS(PTCON0,6)
// PTCON0<PTOPS3>
extern volatile __bit                   PTOPS3              __at(0x7BFF);	// @ (0xF7F * 8 + 7)
#define                                 PTOPS3_bit          _BIT_ACCESS(PTCON0,7)
// PWMCON0<PWMEN0>
extern volatile __bit                   PWMEN0              __at(0x7B7C);	// @ (0xF6F * 8 + 4)
#define                                 PWMEN0_bit          _BIT_ACCESS(PWMCON0,4)
// PWMCON0<PWMEN1>
extern volatile __bit                   PWMEN1              __at(0x7B7D);	// @ (0xF6F * 8 + 5)
#define                                 PWMEN1_bit          _BIT_ACCESS(PWMCON0,5)
// PWMCON0<PWMEN2>
extern volatile __bit                   PWMEN2              __at(0x7B7E);	// @ (0xF6F * 8 + 6)
#define                                 PWMEN2_bit          _BIT_ACCESS(PWMCON0,6)
// QEICON<QEIM0>
extern volatile __bit                   QEIM0               __at(0x7DB2);	// @ (0xFB6 * 8 + 2)
#define                                 QEIM0_bit           _BIT_ACCESS(QEICON,2)
// QEICON<QEIM1>
extern volatile __bit                   QEIM1               __at(0x7DB3);	// @ (0xFB6 * 8 + 3)
#define                                 QEIM1_bit           _BIT_ACCESS(QEICON,3)
// QEICON<QEIM2>
extern volatile __bit                   QEIM2               __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 QEIM2_bit           _BIT_ACCESS(QEICON,4)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// INTCON2<RBIP>
extern volatile __bit                   RBIP                __at(0x7F88);	// @ (0xFF1 * 8 + 0)
#define                                 RBIP_bit            _BIT_ACCESS(INTCON2,0)
// INTCON2<RBPU>
